package algorithms.job4j.sorting;

/**
 *
 * Популярные алгоритмы сортировки:
 *
 * Сортировка пузырьком: Элементы последовательно сравниваются и меняются местами,
 * пока не будут упорядочены.
 *
 * Сортировка выбором: Из массива выбирается наименьший элемент
 * и помещается на первую позицию, затем процесс повторяется для оставшихся элементов.
 *
 * Сортировка вставками: Массив разделяется на отсортированную
 * и неотсортированную части, затем каждый элемент из неотсортированной
 * части вставляется на правильную позицию в отсортированной части.
 *
 * Сортировка слиянием: Массив разделяется на половины до тех пор,
 * пока не останется массивы длиной 1. Затем эти массивы объединяются в отсортированном порядке.
 *
 * Быстрая сортировка: Выбирается опорный элемент,
 * массив разделяется на элементы, меньшие и большие опорного,
 * затем процесс рекурсивно повторяется для каждой из частей.
 */
public class Sorting {
}
